app/controllers/avatar_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def upload
  	@title="上传头像"
  	@user=User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def delete
  	user=User.find(session[:user_id])