app/controllers/community_controller.rb

  def index
	#中文
  	@title="社交圈"
  	@letters="ABCDEFGHIJKLMNOPQRSTUVWXYZ".split("")
  	if params[:id]
  		@initial=params[:id]
  		@specs=Spec.find(:all,:conditions=>["last_name like ?",@initial+'%'],:order=>"last_name , first_name").paginate(:page => params[:page],:per_page =>10)
  		#@pages,specs=paginate(:specs,:conditions=>["last_name like ?",@initial+'%'],:order=>"last_name , first_name")
  		@users=@specs.collect{|spec| spec.user}
---
SELECT "specs".* FROM "specs" WHERE (last_name like 'A%') ORDER BY last_name , first_name
SELECT "users".* FROM "users" WHERE "users"."id" = 1000 LIMIT 1