app/controllers/faq_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "faqs" SET "bio" = 'Bio 是啥麽东东阿,还要写40000个字,真是麻烦.
---
  def edit
  	@title="Edit FAQ"
  	@user=User.find(session[:user_id])
  	@user.faq ||=Faq.new
  	@faq=@user.faq
  	if param_posted?(:faq)
  		if @user.faq.update_attributes(params[:faq])