app/controllers/profile_controller.rb

  def show
  	screen_name=params[:screen_name]
  	@user=User.find_by_screen_name(screen_name)
---
SELECT "users".* FROM "users" WHERE "users"."screen_name" = 'login' LIMIT 1