app/controllers/spec_controller.rb

  def edit
  	@title="编辑用户模型"
  	@user=User.find(session[:user_id])
  	@user.spec ||=Spec.new
  	@spec=@user.spec
  	if param_posted?(:spec)
  		if @user.spec.update_attributes(params[:spec])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "specs" SET "birthdate" = '2011-05-05 00:00:00.000000', "updated_at" = '2011-05-05 09:59:34.732876', "first_name" = '史', "last_name" = '英建', "city" = '郑州' WHERE "specs"."id" = 1