app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
    @title="RailsSpace User Hub"
    @user=User.find(session[:user_id])

INSERT INTO "users" ("updated_at", "screen_name", "authorization_token", "email", "created_at", "password") VALUES ('2011-04-04 14:37:37.610321', 'new_screen_name', NULL, 'valid@aaa.com', '2011-04-04 14:37:37.610321', 'tttttttttttttttttttt')
---
  def register
    @title="Register"
    if param_posted?(:user)
      @user=User.new(params[:user])
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."password" = '' AND "users"."screen_name" = 'engin' LIMIT 1
---
  def login
    @title="Login to RailsSpace"
    #如果是通过限制访问的页面转向到登录界面则验证cookies.
    if request.get?
      @user=User.new(:remember_me=>cookies[:remember_me]||"0")
    #如果是通过提交表单则执行下边程序.
    elsif param_posted?(:user)
    	@user=User.new(params[:user])
    	user=User.find_by_screen_name_and_password(@user.screen_name,@user.password)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "password" = 'aaaaaa', "updated_at" = '2011-04-22 02:43:22.744541', "email" = 'shiyj.cnaaa@gmail.com' WHERE "users"."id" = 1
---
  def edit
  	@title="Edit basic info"
  	@user=User.find(session[:user_id])
  	if param_posted?(:user)
  		if @user.current_password?(params)
				if @user.update_attributes(params[:user])